           10 CUSTOMER-ID                PIC 9(9).
           10 CUSTOMER-NAME              PIC X(60).
           10 CUSTOMER-ADDRESS           PIC X(250).
           10 CUSTOMER-AGE               PIC 999.
           10 CUSTOMER-STATUS            PIC X.
