       01  CUSTOMER-CONSTANTS.
      * FAILURE OF AN OPERATION
           10 CUSTOMER-OPERFAIL   PIC 99 VALUE 0.
      * FOR GET OPERATION , NO DATA FOUND
           10 NEW-CUSTOMER        PIC 99 VALUE 1.
      * FOR GET OPERATION , DATA FOUND
           10 EXISTING-CUSTOMER   PIC 99 VALUE 2.
      * FOR INSERT / UPADTE , OPERATION SUCCEDED
           10 CUSTOMER-OPERSUCC   PIC 99 VALUE 3.
