           10 L-CUSTOMER-ID              PIC S9(9) USAGE COMP.
           10 L-CUSTOMER-NAME            PIC X(60).
           10 L-CUSTOMER-ADDRESS         PIC X(250).
           10 L-CUSTOMER-AGE             PIC 999 USAGE COMP.
           10 L-CUSTOMER-STATUS          PIC X.
